package horse_racing;

import java.util.ArrayList;
import java.util.List;

//        Разберись, что делает программа.
//        Реализуй метод calculateHorsesFinished.
//        Он должен:
//        1. Посчитать количество финишировавших лошадей и возвратить его. Используй метод isFinished().
//        2. Если лошадь еще не пришла к финишу (!isFinished()), то:
//        2.1. Вывести в консоль "Waiting for " + horse.getName().
//        2.2. Подождать, пока она завершит гонку. Подумай, какой метод нужно использовать для этого.
//        2.3. Не считать такую лошадь финишировавшей.




